app/controllers/elements_controller.rb

  def index
    @elements = Element.all
---
SELECT "elements".* FROM "elements"

  def create
    @element = Element.new(element_params)

    respond_to do |format|
      if @element.save
---
INSERT INTO "elements" ("created_at", "number", "symbol", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 22 Sep 2013 16:19:09 UTC +00:00], ["number", 1], ["symbol", "H"], ["updated_at", Sun, 22 Sep 2013 16:19:09 UTC +00:00]]

  def update
    respond_to do |format|
      if @element.update(element_params)
---
UPDATE "elements" SET "symbol" = ?, "number" = ?, "updated_at" = ? WHERE "elements"."id" = 10  [["symbol", "Ne"], ["number", 10], ["updated_at", Tue, 24 Sep 2013 20:54:36 UTC +00:00]]

    def set_element
      @element = Element.find(params[:id])
---
SELECT "elements".* FROM "elements" WHERE "elements"."id" = ? LIMIT 1  [["id", "111"]]